### Terraform Plan - `prod`

| Step | Status |
|------|--------|
| Format | ❌ |
| Init | ✅ |
| Validate | ✅ |
| Plan | ✅ |

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "최신 2개 이미지만 유지"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "preto-streamlit-app"
    }

  # module.ecr.aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "preto-streamlit-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Project"     = "preto"
        }
      + tags_all             = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "preto"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/preto-streamlit-app"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "/ecs/preto-streamlit-app"
          + "Project"     = "preto"
        }
      + tags_all          = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "/ecs/preto-streamlit-app"
          + "Project"     = "preto"
        }
    }

  # module.ecs.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "preto-streamlit-app-cluster"
      + tags     = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-cluster"
          + "Project"     = "preto"
        }
      + tags_all = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-cluster"
          + "Project"     = "preto"
        }

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 300
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "preto-streamlit-app-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-service"
          + "Project"     = "preto"
        }
      + tags_all                           = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-service"
          + "Project"     = "preto"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "preto-streamlit-app-container"
          + container_port   = 8501
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0193a7c1c72f2a43c",
            ]
          + subnets          = [
              + "subnet-0892735c449ac40db",
              + "subnet-0cd2fcdff481b49c2",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "preto-streamlit-app"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-task-def"
          + "Project"     = "preto"
        }
      + tags_all                 = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-task-def"
          + "Project"     = "preto"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.iam.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "preto-streamlit-app-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-task-role"
          + "Project"     = "preto"
        }
      + tags_all              = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-task-role"
          + "Project"     = "preto"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "preto-streamlit-app-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-exec-role"
          + "Project"     = "preto"
        }
      + tags_all              = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-exec-role"
          + "Project"     = "preto"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "preto-streamlit-app-exec-role"
    }

  # module.network.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "preto-streamlit-app-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0193a7c1c72f2a43c",
        ]
      + subnets                                                      = [
          + "subnet-0892735c449ac40db",
          + "subnet-0cd2fcdff481b49c2",
        ]
      + tags                                                         = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-alb"
          + "Project"     = "preto"
        }
      + tags_all                                                     = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-alb"
          + "Project"     = "preto"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.network.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-listener"
          + "Project"     = "preto"
        }
      + tags_all                                                              = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-listener"
          + "Project"     = "preto"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.network.aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "preto-streamlit-app-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8501
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "Name"        = "preto-streamlit-app-tg"
          + "Project"     = "preto"
        }
      + tags_all                           = {
          + "Application" = "streamlit-app"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "preto-streamlit-app-tg"
          + "Project"     = "preto"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c11696cf8468ca8e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                 = (known after apply)
  + application_url              = (known after apply)
  + ecr_repository_name          = "preto-streamlit-app"
  + ecr_repository_url           = (known after apply)
  + ecs_cluster_arn              = (known after apply)
  + ecs_cluster_name             = "preto-streamlit-app-cluster"
  + ecs_service_name             = "preto-streamlit-app-service"
  + ecs_task_definition_family   = "preto-streamlit-app"
  + ecs_task_definition_revision = (known after apply)
  + log_group_name               = "/ecs/preto-streamlit-app"
  + subnet_ids                   = [
      + "subnet-0cd2fcdff481b49c2",
      + "subnet-0892735c449ac40db",
    ]
  + task_execution_role_arn      = (known after apply)
  + task_role_arn                = (known after apply)
  + vpc_id                       = "vpc-0c11696cf8468ca8e"

```

</details>

*Pushed by: @chankoo*